# SQL Function

In [2]:
%reload_ext sql

In [3]:
%sql sqlite:///course.db3

In [4]:
%%sql
create table professors(
last_name varchar(20),
department varchar(12),
salary INT,
hire_date date);

 * sqlite:///course.db3
Done.

[]

Inserting data into table

In [6]:
%%sql
insert into professors values ('Chong', 'Science', 88000, '2006-04-18');
insert into professors values ('Brown', 'Math', 97000, '2002-08-22');
insert into professors values ('Jones', 'History', 67000, '2009-11-17');
insert into professors values ('Wilson', 'Astronomy', 110000, '2005-01-15');
insert into professors values ('Miler', 'Agriculture', 82000, '2008-05-08');
insert into professors values ('Williams', 'Law', 105000, '2001-06-05');

 * sqlite:///course.db3
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
SELECT * FROM professors

 * sqlite:///course.db3
Done.

[('Chong', 'Science', 88000, '2006-04-18'),
 ('Brown', 'Math', 97000, '2002-08-22'),
 ('Jones', 'History', 67000, '2009-11-17'),
 ('Wilson', 'Astronomy', 110000, '2005-01-15'),
 ('Miler', 'Agriculture', 82000, '2008-05-08'),
 ('Williams', 'Law', 105000, '2001-06-05')]

## UPPER and LOWER Function

Return either uppercase or lowercase value of correspond table only applied on varchar data Type.

In [22]:
%%sql
SELECT UPPER(last_name) as UP_Last, LOWER(department)
FROM professors

 * sqlite:///course.db3
Done.

[('CHONG', 'science'),
 ('BROWN', 'math'),
 ('JONES', 'history'),
 ('WILSON', 'astronomy'),
 ('MILER', 'agriculture'),
 ('WILLIAMS', 'law')]

## Boolean Condition

Return 0 or 1 of Condition per column based on argument

In [44]:
%%sql
SELECT (salary > 95000) as Boolean
FROM professors

 * sqlite:///course.db3
Done.

[(0,), (1,), (0,), (1,), (0,), (1,)]

In [41]:
%%sql
SELECT (last_name || ' works in the ' || department || ' Department') as selection 
FROM professors
WHERE last_name = 'Chong'

 * sqlite:///course.db3
Done.

[('Chong works in the Science Department',)]

## MAX and MIN Function

return maximum and minimum value for correspond column.

In [28]:
%%sql
SELECT MIN(salary) as min_sal, MAX(salary) as max_sal
FROM professors

 * sqlite:///course.db3
Done.

[(67000, 110000)]

## COUNT Function

Count table row.

In [32]:
%%sql
SELECT COUNT(*)
FROM professors

 * sqlite:///course.db3
Done.

[(6,)]

## COALESCE

Replacement of NULL Value.

#### Create Table that contain NULL

In [33]:
%%sql
CREATE TABLE IF NOT EXISTS memberships (
    membership_id INT     PRIMARY KEY,
    program_name  TEXT    NOT NULL,
    net_price     NUMERIC NOT NULL,
    discount      NUMERIC
);

 * sqlite:///course.db3
Done.

[]

In [34]:
%%sql
INSERT INTO memberships(program_name, net_price, discount)
VALUES('1 Month', 100, null),
      ('3 Months', 300, 10),
      ('6 Months', 600, 30);

 * sqlite:///course.db3
3 rows affected.

[]

In [36]:
%%sql
SELECT * FROM memberships

 * sqlite:///course.db3
Done.

[(None, '1 Month', 100, None),
 (None, '3 Months', 300, 10),
 (None, '6 Months', 600, 30)]

In [38]:
%%sql
SELECT (net_price - discount) as Total_price
FROM memberships

 * sqlite:///course.db3
Done.

[(None,), (290,), (570,)]

Total Price marked as none since NULL value of discount table, in order to rightly calculate use COALESCE to alter NULL into specific value.

In [39]:
%%sql
SELECT (net_price - COALESCE(discount,0)) as Total_price
FROM memberships

 * sqlite:///course.db3
Done.

[(100,), (290,), (570,)]

## LENGTH

Fing Length of String for each row.

In [43]:
%%sql
SELECT LENGTH(last_name)
FROM employees
LIMIT 5

 * sqlite:///course.db3
Done.

[(7,), (5,), (7,), (9,), (7,)]

## Merge Column Data using ||

In [46]:
%%sql
SELECT last_name || ' is professors of ' || department || ' department' as merge
FROM professors

 * sqlite:///course.db3
Done.

[('Chong is professors of Science department',),
 ('Brown is professors of Math department',),
 ('Jones is professors of History department',),
 ('Wilson is professors of Astronomy department',),
 ('Miler is professors of Agriculture department',),
 ('Williams is professors of Law department',)]

## Finding Position Using INSTR

In [59]:
%%sql
SELECT email, INSTR(email,'@') pos
FROM employees
LIMIT 5

 * sqlite:///course.db3
Done.

[('bmanueau0@dion.ne.jp', 10),
 ('amcnee1@google.es', 8),
 ('ssymonds2@hhs.gov', 10),
 (None, None),
 ('fmorffew4@a8.net', 10)]

## Split String using SUBSTR

In [63]:
%%sql
SELECT email, SUBSTR(email,INSTR(email,'@')+1) as domain
FROM employees
LIMIT 5

 * sqlite:///course.db3
Done.

[('bmanueau0@dion.ne.jp', 'dion.ne.jp'),
 ('amcnee1@google.es', 'google.es'),
 ('ssymonds2@hhs.gov', 'hhs.gov'),
 (None, None),
 ('fmorffew4@a8.net', 'a8.net')]